[{"title":"微医","date":"2017-04-04T14:58:11.000Z","path":"2017/04/04/微医/","text":"","tags":[]},{"title":"他们这么说 俺来也","date":"2017-03-31T14:22:28.000Z","path":"2017/03/31/哈哈，俺来也/","text":"用户这么说“俺来也”数据来源：IOS，android 平台 app所有评论 数目：1265 采集时间：2017-3-28 俺来也用户热度变化趋势 根据百度指数,俺来也的用户热度在2016.10.23达到4979，在2016.11.11这天达到最高峰：4986。 用户属性 性别分布 从数据可以看出，俺来也的主要用户年龄层为“18—24”大学生，接近60%的用户群体。其中男性比例达到62.3%，女性为37.7%。主要用户为大学生中的男生群体。 再来看看这些用户到底说了什么。-评论星级分布： 5星好评为79%，1星为11%，其中4星评论也占到7%说明大部分用户对于俺来也的主管印象还是正面评价。 再看看评论主要集中的时间段：其中在2016.10.5评论人数最多，同时在2016.3.1和2017.3.3这两天，用户的评论人数也达到高峰期 再来看看一天中用户最喜欢在哪个时间段评论 数据显示在一天的14点，19点 11点，17点是用户评价的高峰时间段，而这两个时间段也是在午饭，晚饭前后对app进行评价！ 更直观的时刻每天的14点，19点是用户评价高峰时间段 先来看看5星评论的用户都说了什么数据中最多被提到的关键词为：“零食”，“大学生”，“配送”，“便宜”。可以看出大学生群体对“零食”的需求是非常火热的，但是同时对价格因素也很敏感 再来看看非5星评论的用户都说了什么 用户对于“软件”，“客服”，“配送”，“早餐”这块的抱怨位列前四。同时也反应了“俺来也”在app 用户体验，客服，配送方面的诸多不足。 都是哪些人在评论，我们来看看评论数量超过五条的用户都有哪些 其中“圈圈他爸”，“阿里云计算”，“Summer安子”,的评论数量都超过10条。不过，查询评论详情后，发现并没有 恶意刷差评的用户出现同时，反馈给我们一个信息：1.用户对我们的主观概念是认可的。2.还没有明显的竞争对手出现 评论分类目前根据评论的详情，通过文本分析内容归类可以分：问题类，功能类，活动和价格。 问题类 功能类 活动和价格 总结：经过对用户评论详情的分析，得出在一些重大节日，顺势推出相应主题活动，可以刺激用户更频繁的使用产品，而在一天中的午饭，晚饭前后用户更倾向去评价。 优：用户对于俺来也还是肯定的态度，其中“零食”,“校园”，“早餐”，“社团”等因素在用户群体中得到充分肯定。 劣 1.软件用户体验欠佳 2.客服专业度不足、 3.配送速度欠缺 4.退货，退款环节体验不足。","tags":[]},{"title":"关于路口，用户都在说什么？","date":"2017-03-26T10:38:17.000Z","path":"2017/03/26/路口/","text":"关于路口，用户都在说什么？数据来源：IOS平台非五星评论 数目：600 用户的差评都在说什么？ 数据显示 “闪退”，“软件”，“程序员”，“客服”这四个词被提及的最多，同样体现出了“路口”的软件和客服 这两个方面的问题严重。 词云 总结- 提高软件的用户体验，优化闪退等bug. - 加强客服的专业性培训","tags":[]},{"title":"关于卷片，用户都在说什么？","date":"2017-03-23T14:03:08.000Z","path":"2017/03/23/关于卷片，用户都在说什么？/","text":"关于卷皮，用户都在说什么？相关数据来源： 安卓平台“卷皮折扣”5星评价13512 非5星评价6800 时间：2017.3.19 首先来看看当用户搜索“卷皮折扣”的时候还会关注什么？来自 百度指数 官网？质量？靠谱？。。。 还是质量。。。 可以很明显的看到，作为用户来说在线上购物首要关注点是平台安全合法性和平台商品质量！ 同时，也看到了卷皮方面对于营销推广方面的欠缺，哪怕自己去写几篇软文也好啊。。。 用户画像 从消费人群性别分布看，女性人群占比超过男性人群，所占比例达到78.9%；从年龄段分布看，以25-34岁为代表的80后人群比重快过半，占比达到46.3%，其次为25岁及以下的90后等人群，占比30%，36-45岁人群则占比13.5%。 嗯，女性能顶一片天 5星内容分析用户给五星好评的时候都说了什么： 感觉好像看不出有什么明显的个人感情色彩 看看词频 提及最多的竟然是软件！ 不过卷皮的定位“便宜“这个概念确实得到了用户很多回应，接下来就是衣服。 总体看来，个人感情色彩的词也很少提及到，评论非常客观。 再来看看差评都说了什么 。。。 负面词真是不要太扎眼 再看看词频统计 骗人，软件，质量，客服。。。 看起来真是一堆问题 软件体验不好，要卸载。。。 不过我很奇怪的是，卷皮的商品 都是人工质检的，按理来说，质量这块应该也是值得放心的才是。还有”客服“，卷皮的客服也是平台自营的，可是对这块的 抱怨也高达15%！ 在艾瑞咨询网站所查到的数据 中国网购用户消费越来越回归理性。消费者不仅关注商品本身的质量、价格，也关注品 牌、品质以及品牌内涵对生活方式的延伸等更高层次的需求。2015年络购物大调研数据显示，品质已经成为用户网购时 最看重因素，价格为第三看重因素，网购用户开始从生活品质出发选择商品而不再是单纯从价格出发，消费持续升级。 总结网络购物进入移动端主导时代， 品质竞争成关键，用户更加注重商品质量和购 物体验，不再一味追求低 价，电商平台从价格战转向 用户粘性培养 用户增速放缓，获客成本上 升，“内容”作为高效获取 流量的方式，与电商结合日 渐紧密，成为重要入口 导购网站影响用户消费决策 对于解决已经出现的问题作为仍为成长创业期的企业来说，意义不言而喻。对于不可控因素例如“物流”，“商家”可能短期内无法改变之外，对其他客观因素相信平台是有能力改善的。 - 严格把控商品来源，确保所属商品的质量可靠 - 产品运营团队，在运营推广的过程中应该更突出平台“安全，合法，靠谱”，平台商品“质量，货源”有所保障 - 优化产品，提高用户体验 - 加大对客服人员的专业培训 - 提高在用户退款退货方面的用户体验 —-由于时间紧，在刚刚10点多接到贵公司第二天的面试通知后，才着手准备这方面的分析工作，编写爬虫爬取数据，准备仓促可能对于数据的分析深度上还有所欠缺，在有些表达欠缺的地方还请前辈多多指导。","tags":[]},{"title":"关于卷皮，我想说","date":"2017-03-20T14:34:43.000Z","path":"2017/03/20/关于卷皮，我想说？/","text":"关于卷皮，我想说背景：3.17日接到卷皮网的通知，3.18号下午三点四十在华科参加笔试（产品经理助理）。总共两套题一套是所有人都要做到行政测试题，逻辑推理+数字推理+图形推理。还有一套专业题，总共有两道大题。 1.电商平台争相开展直播业务，你认为有哪些原因？ 为了更好的将直播和销售结合，你觉得电商直播和传统的娱乐， 游戏直播，应该有哪些差异？ 2.你认为微信内用户体验不好的三个功能点，你觉得应该如何改进？ 自己平时对直播这块不太关注，所以感觉答得都不是很完整，也就对下轮面试不抱希望了。晚上失落的回到学校，去健身房练了一个小时无氧，随后跑了5公里，心情低落的回到寝室就准备洗衣服了。。。 不过这个时候竟然收到了 卷皮 19号上午11点的面试通知，邮件末尾写着“请携带个人最新简历和项目作品。。。。。”心想 我没有什么作品啊！！！这不是完蛋的完，这不行啊，好不容易从几百号人里有了面试的机会，怎么可以轻易放弃，我该带什么作品呢。。。。原型设计的工具？还是产品体验分析报告？ 这些是不是都太常见了，有没有其他有点新意的东西，对了，去分析分析“卷皮折扣“这款app的评论吧，看能不能有所发现。说干就干，分析网站，写爬虫，数据分析，写报告。。。等完成这份报告竟然都凌晨三点了，而我的成果 连图带文也就五页而已。。。。 第二天打印了报告，就赶到软件园的卷皮楼上，面试的人非常多，技术的，非技术的全在今天。里面环境非常好，很有互联网公司的气息，不愧是武汉本地数一数二的互联网公司。更加剧了我想留在卷皮的决心。随后，等了差不多一个多小时后被叫到了一个会议室，是一个感觉年纪蛮大的一个老师，然后开始自我介绍，等我巴拉巴拉说完，然后把我做了一个凌晨的报告交到他手上，然后面试官翻着看了下，聊了两句这个报告的内容就说好了，你准备下一场复试吧！！！！ 啊，我没听错吧，什么都没问我呢，我怯怯的说，您不再问点什么了吗？ 不用了，我觉得你挺优秀的，等下好好复试吧。 嘿嘿嘿，心里难免有点小窃喜，太好了。。。。。 然后去楼下吃了中午饭，之后被带到16楼，原来卷皮有两层的办公，真是壕，环境真是好的没话说。我告诉自己一定要留下来！ 加油！！！ 复试面试官去吃饭了，我们一群复试的待在一个会议室里，总共有10个人，四个产品，6个技术的！真的不由得感慨一路来真是艰辛，去华科参加校招，人多到只能站在教室外面，而且还会去武大校招。 这是我当时在教室后面拍的照片，可以看到现场气氛的火热讲台上可以看到只露出一个人头的 那个是卷皮网创始人“黄承松”，华科毕业，在校创业发展到现在，回到母校校招，说实话，对于我来说虽然也在学校创过业，不过都是瞎搞什么的，对于黄总可以将一个学校的团队，一步步发展到现在，我真是无比的崇敬，同样对于黄总的个人魅力我也是相当钦佩，而我自己就更想在卷皮，和卷皮一起成长，发展！ 扯回正题，这四个复试产品的人中，有两个女生，一个华科，一个财大，还有一个男生是武大。。。。这顿时压力好大，全是985 211 呀，这。。。 哼，就是要抢，就是跟985 211 的要抢，谁能拿到offer还不一定呢，既然我们现在都是等复试，那我们的起点现在是一样的，没什么大不了的，我就是要跟你们抢。 随后我是第一个被喊到的，面试官感觉挺有精神的，只不过是个大胡子，感觉有点玩音乐的那种感觉。然后开场就是 老套的自我介绍，自我介绍完了，然后把我的分析报告递给面试官说： 这是我昨天晚上连夜写了一个爬虫，数据为 豌豆荚上面卷皮折扣的所有非五星评论，因为内容都是非五星，可能会引起您的反感。。。而面试官也非常大度的说：其实，他们是很乐意看到这种批评的声音的云云。。。 随后在他翻阅报告的时候我先开口问了一个问题：我们知道卷皮呢其实和 蘑菇街是直接的竞争对手，那那个今天中午刚刚有新闻报道说 蘑菇街被央行约谈，说是因为 金融业务这块有问题。。。那卷皮作为用户活跃度过千万，用户数量过亿的企业，金融这块恐怕也很有漏洞吧。。。 当时面试官一愣，感觉似乎没有关注这方面。只是随便敷衍了事罢了。不过我的目的已经达到了，1.突出我是一个时刻关注互联网的人。2.我是一个对 竞争对手和企业的有过深入了解的，上岗后不用这方面的培训。 随后 面试官就开始进入正题了，开始聊我的笔试题的内容，因为我当时在写微信的用户体验差时有写到微信的聊天内容云上传后 不能多设备同步 然后面试官问我：“你要是作为微信的产品经理，你觉得为什么不做这个功能？ 说真的，这个还真没考虑过，然后我说 能不能给我一分钟考虑，随后我拿出笔记本和笔，开始画微信聊天的信息传送流程。。。。服务器，云储存。。。。我回答：第一，出于安全。可以保证你的隐私不被轻易获取。第二，同步到第二台设备后的用户体验会下降 然后面试官没有作声，看到我写到了云储存，就问我 你知道微信聊天内容的 云储存机制是什么样儿的 我说：“ A的信息发送过来，会先请求服务器，然后服务器返回一个响应，再传送到云。。。。。”虽然说是计算机专业出身，不过真心对 云存储这块不是很清楚， 然后面试官说，不知道也没关系，这个后面是一套相当复杂的机制。。。。。 然后又聊到了电商的话题，你觉得一个正常的下单流程是怎么样的，有哪些可以优化的地方 流程图画了，最后怎么回答的，记不清了。。。 然后还问道假如，你入职之后你首要关注的是哪些？ 这个当时考虑了一分钟，还是很有条理的说了些 第一： 根据我的分析报告，对客服人员进行更专业的优化 第二： 严把商品质量关，对质量欠佳商品一律下架 第三： 优化购物流程。找到以前的数据，慢慢分析数据，对比同期数据的变化，相信数据分析的能力，小数点后面可能就是成百上千万的交易。 然后就跟我讲了，关于购物流程的 漏斗模型。。。。最后有的没的聊了一会别的，就说面试到此结束， 我说 能不能麻烦评价一下我关于产品这块的觉悟吧。。。。然后说了我的逻辑思维这块还是在学生的角度来说还是很优秀的，置于具体到经验这块是有些不足，不过可以理解什么的，感觉都不是在给我提建议，更像是在夸我的感觉。 最后说，回去等我们这边HR 的通知，你应该会得到一个满意的结果 这时，心里已经欣喜万分了，梦想就要实现了，产品经理！ 终于轮到我 出场了 ！！！！虽说，没有正式拿到offer,不过，有非常强烈的感觉，我应该会通过的。 出了大楼，外面开始下雨，该死又没带伞，不过 完全影响不了我的好心情，感觉走在雨中，都可以看到明媚的阳光 撒在我的身上，无比温暖！ 开始憧憬着自己在卷皮的生活，在产品这个岗位的发展。。。。 故事到这里是不是觉得 应该是个非常常理的一个炫工作的故事！ 然而，注意，我说然而， 然而 并不是，咳咳，第二天，也就是星期一，坐在图书馆如坐针毡。手机的每次响动都牵扯着我跳动的心。 终于，宣判 在下午 13：58到了！ * 你好， 感谢你参加卷皮2017校园招聘！你认真的态度给我们留下了深刻的印象，但经过慎重考虑，您所具备的技能和我们的职位要求还不是完全符合。我们会将您的简历存在简历库中，一旦有合适的职位，我们会立刻和您联系。期盼以后你能继续关注和支持卷皮，也祝你前程似锦! 脑子随后一片空白，这不对吧，正确的入职信息不是这样的呀。什么叫合适的会再联系，到底是刷了还是怎样。 哎，说实话 很受打击，因为付出了很多，从笔试初试到复试，而且最后面试官也给了我正向的反馈，结果还是挂掉了，心累。。。。 哎，本来是想写的是，我做的关于 卷皮的那份分析报告”关于卷皮，用户都在说什么？“ 结果写成了 我要说什么，那下篇再好了。。。","tags":[]},{"title":"做做用户画像","date":"2017-03-17T04:06:01.000Z","path":"2017/03/17/做做用户画像/","text":"做好用户画像什么是用户画像用户画像又称用户角色，是根据用户特点而勾勒出来的用户画像，包括了地区，县市，归属地、姓名、性别、年龄等用户属性的数据。企业借助用户画像，全方位了解用户需求，进而实现产品的准确定位和精准营销。PC、手机、智能设备的数据，在被处理后，就形成了一个个“用户画像”。 更形象的说就是 用户画像是根据用户社会属性、生活习惯和消费行为等信息而抽象出的一个标签化的用户模型。 比如说当我们在淘宝买了东西之后，淘宝就会根据我们的购物习惯，浏览量，查看率，点击率。买了什么产品，根据产品的属性，都会形成我们个人的不同标签。 用这些不同的标签就可以形成用户画像。 用户画像方法 固有基本属性标签 比如人口统计学的属性信息，这些信息包括性别、年龄、职业、学历、籍贯、婚姻、收入、房产等信息。如果你有客户的身份证号码，你就可以提取出用户的籍贯、出生日期、性别等信息 通过基础信息处理得到标签 比如说根据你的出生日期就可以推算出星座、生肖、性格等，因为我们知道不同的星座会有不同的性格或者做事风格，如处女座追求完美。 通过用户行为推测标签 例如用户购买了高尔夫球用品，你可能就是高端商务人士或老板，那么可能会被贴上高收入、高端等标签。再例如如果购买了卫生巾的客户，那么可能就被贴上女性、非孕妇等标签，这就是根据用户的一些行为特征推测添加的标签。 数据挖掘建模输出标签 例如从几个指标综合对用户进行聚类分析，最终会得到不同用户群体，每个群体就有一个标签，属于什么类；再比如流失预测模型，模型最终输出流失概率得分，我们可以根据流失概率得分的高低，划分为高流失用户、中流失用户、低流失用户、不流失用户等标签。","tags":[]},{"title":"记一个QQ好玩的 bug","date":"2017-03-12T08:20:35.000Z","path":"2017/03/12/QQ/","text":"记一个QQ好玩的bug刚才登上许久没有上的QQ, 又有一大堆未读消息，像往常一样我在消息列表上按着 消息数目滑动，随后就不再又让人心惊的红色未读提醒了。 不过出于好奇的态度，我又去看”消息“按钮上面的提醒数字，就是下面这个 当然大家都知道这个数字也是可以滑动的，滑动之后所有未读消息提醒就没有了。 出于腾讯将这个数字消失动画做的太动感我又想看到目的，随后我又去点了消息列表的 标为未读就是下面这个 然后下面就又有消息数字了，哈哈哈，然后欣喜若狂的去滑数字（哈哈哈，没错，我就是闲的没事干的小学生） 注意！！！注意！！！注意！！！当我再去滑动消息按钮上面的数字之后，联系人上面的红色数字就像一个个听话的小蜜蜂一样，在屏幕上面 拖着一条红色的尾线，像被戳破的泡泡一个接一个随之消失。。。。 你以为 就这样就完了吗 呵呵呵， 那我岂不是变成了深恶痛击的标题党。 我是认真的好吗。。。 接下来就是见证奇迹的时刻。。。。。你会看到 一个个红色数字就像商量好的一样又欢快的蹦出来了！！！！！蹦出来了 ！！！！蹦出来了！！！哎哟，还挺倔强啊，我再滑，又一次咚咚咚的消失 哈哈哈哈，暗自冷笑一声 看你还出不出来，小样儿，跟我斗，还嫩的很呢 蹦蹦蹦…. 我这个逼还没装完呢， 竟然蹦出来了，还这么又节奏感 这么执着吗 我滑， 咚咚咚。。。。 蹦蹦蹦。。。 非要较真吗 我滑，咚咚咚。。。 蹦蹦蹦。。。 妈妈，救命呀，这数字 成精了。。。。 哭脸ing。。。。 我错了。。。大佬们 快走吧，求你们啦，快走吧。。。回头烧香给你们，嘤嘤嘤。。 再经过九九八十一个回合之后。。。。 。。。 。。 。 好激动，，我要唱首歌 最终解铃还须系铃人啊，在我点了 标为已读之后，这群勤劳的小蜜蜂终于走了 好开心啊","tags":[]},{"title":"微信，为什么要做“仅向朋友展示半年的朋友圈 ”？","date":"2017-03-12T07:09:17.000Z","path":"2017/03/12/微信/","text":"微信，为什么要做“仅向朋友展示半年的朋友圈 ”？最近在微信上面发现一个不知道什么时候添加到的新功能“仅向朋友展示半年的朋友圈” 功能设置入口：我的—设置—隐私↓↓↓ 一开始不觉得怎么，不过毕竟是全民应用，它的每个动作都会放大在亿级的放大镜下。这么做肯定有很强的需求！那么为什么只看半年的朋友圈呢？ 想到这儿，不由得细思极恐，微信对于人性的洞察真的太恐怖了。 相信每个人都有不堪回首的一幕，拿我自己举例，现在正是春招自己找工作的阶段，很多时候都需要去招聘方的微信，那我还是有点担心我朋友圈里曾经高调的晒出 曾经某天自己翘课出去打球，旅游的照片。某天凌晨两点仍在街头溜达的记录，生日会上宿醉嗨歌的热火…..很不确定在自己心仪的公司面前，当看到自己有时的放纵会怎么重新定义自己。 对于那些经常晒男女朋友狂撒狗粮的同学来说，在换了现任之后，是不是真的可以一干二净的删除自己曾经美好的记忆。 甚至是我们去剪个头发，拍个照片，吃个饭，买个水果。。。。老板们都会笑呵呵的要求加个微信，以后会有优惠。。。 如此云云….. 人都有傻逼的岁月，当下这个时间点觉得自己很牛逼发了朋友圈，发过后太久了自己都忘记了，然后加了新的朋友，他们翻你的朋友圈了解你过去的动态，若看到当初哪些个傻逼的朋友圈不就尴尬了么… 通常我们都会设置分组标签，可是很多时候分组标签越来越多，慢慢随着走出校园接触到更多形形色色的人，分组标签这种方式已经难以满足对于自己所谓隐私的保护权， 如果一概而定的 屏蔽掉一些人，当别人想看你的朋友圈，然后别人问起那势必更加尴尬。 从微信发展的角度来看： 以前微信大部分是从通讯录、好友、同学间的熟人社交圈，看到我的生活没太多关系。可是现在微信上的关系，已经突破了熟人圈，会加到互不相识甚至是很多陌生人，比如什么打折促销，卖保险，去拍个证件照回个头老板也笑呵呵的问你能不能加个微信，然后以前自己的资料肯定也会展现无遗，这个时候就没有必要对陌生人去透露自己过去的事吧？ 从人性的角度来看： 针对个人来说，确实有些过去，自己想保留起来， 对新朋友来说，也没必要过多了解自己的过去 听起来是不是感觉贴心的不要不要的，等等，接下来我们再来体验一下再下定论 这是我打开设置之后，用朋友的手机进入我的朋友圈看到的。瞬间一脸黑线。。。。这是什么 啊喂！！！！？？？？？还不如直接屏蔽人家呢，为什么要显示一行字，我们需要的是下面这样的一条线好吗。而且好像 安卓机还没有这个功能。。。 对此呢，还有以下疑问建议： ”半年“ 这个时间点是如何定义的？ 为什么是”半年“ 是从今天到过去的半年 还是 从最新的朋友圈到半年签到动态。 可不可以只对新加的好友 有限制呢？ 设置功能之后还要提示别人说，朋友仅展示最近半年的朋友圈。这样是不是会更激起一些人的好奇心，让他们更期望看到全部。那岂不是跟原来目的背道而驰。 对于这个话题，我在知乎上面找到了腾讯官方的回应：为什么微信要推出“仅向朋友展示半年的朋友圈”功能？ 可以看出腾讯为了避免可能带来操作的复杂性，用户自身也容易混淆哪些状态屏蔽了哪些人，不利于体验。而没有做只对新好友的限制。 当然还不能解答我的疑惑，如果有朋友有其他不同的看法和见解欢迎一起来交流讨论","tags":[]},{"title":"产品经理，你到底要什么样的应届生？","date":"2017-03-10T05:35:23.000Z","path":"2017/03/10/产产品/","text":"产品经理，你到底要什么样的应届生？咳咳，说个很尴尬的事，在本人开始谋求产品方向的工作后，到现在还没有找到工作，期间自己也做了很多工作，学Axure,Visio,Xmind等工具，看了凯文凯利的著作《失控》，周宏伟的《我的互联网方法论》，《精益创业》，《产品心经》《结网》《启示录》《人人都是产品经理》《产品型社群》等一系列锻炼自己思维的书籍，不过印象最深的就是 日本战略之父 大前研一的思考的技术，打开新世界大门的感受。当然还有很多新啰嗦的，在此就不废话了，现在让我们来看看产品经理究竟需要怎样的应届生！ 数据采集： 数据来源： 拉勾网 数据类型： 产品经理/助理 数据条件：应届生 数据数目：233条 数据说明：本数据为拉勾网上 产品经理/助理，应届生目录下的所有信息。 产品经理最重要的素质与技能要求这里对所有数据进行分析，目的是了解互联网企业招聘产品经理时对应届生所需要具备的素质和技能。 企业最看重产品经理的沟通能力和逻辑思考能力 通过对职位描述的 岗位描述和岗位要求分析得出如下图：没有想到的是沟通能力最受关注，竟然高达83.5%，我想可能是因为产品这个职位对 产品经理的要求具有全面能力，无论是市场，开发，需求，运营，设计….都有一定的要求，而且工作中也更多的时候和团队中的开发，设计，市场，boss进行交涉，所以，在确保产品能够稳定成长的前提下，沟通能力是一项必修课！ 而思维能力也占到很大比重！不过令人惊奇的是 应届生经常自以为宣称自己的学习能力反而要求不是很高。 最需要产品经理具备需求分析和撰写产品需求文档的能力 产品经理所要求具备的技能最常被提到的有输出需求文档，需求分析、数据分析、交互设计、利用Axure,office等软件制作原型的能力。 企业要求产品经理的基本素质 企业所提到对产品经理一职的基本素质，沟通能力又是第一位。接下来是团队合作能力，可以预想的到要想做出一个好产品必须要拥有一个好的团队，团队每个成员都必须紧密合作才有可能将一款产品从 0 到 1，慢慢实现。当然还有重要的逻辑思考能力，有53.1%的岗位都有提及到。极强的逻辑思考能力可以帮助我们更容易地透过表面，看清复杂事物（尤其是掺杂了大量繁复且真真假假的信息）的本质和脉络，从而能够更合理地调配资源，尽可能把每一刀都切到蛇的七寸上，以尽可能低的成本解决问题。还有我们经常看到的 职位要求中第一条经常是热爱产品，也占到了35.3%。 企业要求产品经理所掌握的技能 接下来我们看到企业明确要求求职者所需要掌握的技能，跟设想的一样，作为产品人一定要懂得需求分析，不论是在线类如网站或一些在线产品，还是系统类如各类管理系统，抑或移动终端如APP，产品的第一步必然是我做这款产品想要满足使用者什么样的需求，也就是需求分析。可以说需求分析是整个产品诞生的首要重要的一步。接下来是制作原型，和交互设计能力，比如Axure,Visio等一些常规的原型设计工具要掌握。另外需求文档差不多和数据分析不相上下，产品胚胎期的需求文档能力，和增长成熟期的数据分析，也是对产品人来说迈不过去了槛。 再来看一组企业对产品经理职责的定义内容： 这是一组产品经理职责定义内容的词云，可以很清晰的看出 产品，需求，设计 这三大命脉。几乎明确说明了一款好的产品需要满足的特性。 1. 很好的解决了用户的需求。 2. 具有良好的用户粘性 3. 优秀的用户体验 企业对产品经理所提到的要求： 在对产品经理的要求这张图里，我们可以看到产品，数据，设计，计算机。 做产品到一定的时期难免会面临瓶颈期，所以拥有一定的数据分析能力也是相当必要的，可能这对于非计算机专业学生来说，确实有点门槛，不过至少需要掌握SQL语句，基本的增删改查要懂，对数据也要敏感。 产品经理需求分布数据来源：百度指数 百度指数显示，由于现在产品经理这个职业的火爆也催生了一批产品经理培训的产业。当然我们也看到诸如 运营，产品设计，人人都是产品经理这些热词搜索，也能看得出产品人的技能树要求是多么庞大。当然这也难阻挡对其的追逐，相信有梦想的人追究会实现，衷心祝愿每个真心希望从事互联网产品的人走的越来越高，实现自我的人生价值。 总结 在产品这个岗位上，初入职场的应届生确实离企业的要求相去甚远，而且对各方面的综合能力要求也 是相当高，另外计算机相关专业真的会有加分。通过分析可以让像我一样想从事产品的应届生，明确自己能力的不足点，进行有针对性的提高，任重而道远，还有很长的路要走，让我们撸起袖子加油干。 （PS:这是本人第一次做数据分析报告，可能有些地方表达不是很明确，并且对数据拿捏的不是很了解，根据自我的理解难免会有一定的错漏之处，还请各位前辈大大们不吝赐教。）","tags":[]},{"title":"来套百度全家桶","date":"2017-03-10T02:03:16.000Z","path":"2017/03/10/百度/","text":"在面试的时候 ，碰到这么一道题： 百度为什么要做贴吧，知道，百科，经验等产品？这真是令人尴尬，认真的讲，我还真没考虑过这个问题，不过根据我的观察这些产品面向的人群特征也是不一样的。 百度贴吧的受众比较活跃，用户粘性高且偏年轻人。 百度知道的人群年纪偏大点，比如我所观察到的年长的人，基本上都是在百度知道里问问题，而不是在百度首页。 百度百科这是一种相对专业，有标准答案可以提供。 百度经验一般来说面对比较复杂的问题，需要向有专业经验的人求问并且解决方案大多时候也不同。 现在看我答的东西，真是要笑哭。。。 这什么玩意，能过笔试就怪了。。。 痛定思痛的坐下来好好缕缕百度的成（fa)长(jia)史 众所周知百度是搜索平台，那么为了满足用户获取信息的需求，要怎么满足呢？ 我想计算机专业的人都知道， 通过机器去实现！通过爬虫，存储，索引，排序等展现搜索结果。说到爬虫了，提点题外话，前一阵在知乎上看到一个问题 爬虫会全屏蔽掉吗？ 我只能说 只要web还存在，oh不，不止web,还有现在火热的移动端app, 只要人类需要互联网，爬虫就可以伪造成人类的行为进行访问，咳咳，也就是说：想要消灭爬虫，恐怕得先消灭互联网了。 回到正题百度通过机器实现这样就够了吗？ 不是！机器的能力是有限的，还有很多用户的需求解决不了或者说解决不是很到位，所以就需要人来实现。通过广大的用户为某一用户来提供其需要的信息。这是从大的方向的说。 从垂直从角度来说，贴吧，知道，百科，经验等都解决用户在人的这个方面不同的需求。在现实生活中，当我们有问题要寻求答案时，一般都是比较简单的why,where,when及how等问题，大都是采取的解决方案都是去问别人，然后按照已有的答案去执行。这种问答对应的就是 百度知道！ 当遇到一些专业术语，名词问题时，一般都是what，who等的问题，并且问题一般都有标准答案，大多数人都会去查字典和百科全书，这个就是百度百科！ 当遇到一些比较复杂的which，what，why，who等问题，且一般没有标准答案，有可能需要用到群体智慧来解决，既一群人对某个问题或帖子进行集中探讨，这种BBS形式对应的就是百度贴吧！ （说到群体智慧，想起一本 集体智慧编程 的书，推荐阅读） 当遇到一些复杂的问题诸如 how等问题，且一般没有标准答案，大多数人都会去找有专业知识，专业经验的人寻求帮助，这个对应的就是百度经验！ 百度全家桶之间的区别 百度知道可以帮助用户解决各种类型的问题，而百度经验集中解决用户“怎样做”“怎么办”这一类的问题，并专门针对这类问题所具有的普遍性、过程性的特点，提供更便于用户阅读、学习和尝试的解答形式。一篇经验文章中，通常包括概述、工具/原料、步骤/方法、注意事项、参考资料等几个部分，一般都含有丰富清晰的图片，用户可以按照文字和图片的指导，一步步操作直至完成。但百度经验不能解决过于个性化、定制化、结果化的问题。在百度知道必须根据提问者的信息和需要来提供回答，而在百度经验可以自行创建一个“问题”并分享相关的经验。 百度经验的来源作者较为高端，将邀请众多各行业机构、专家、学者、民间高手组成经验智囊团，提供较为专业权威的经验供用户参考，力争保证每一篇经验都能够给用户带来实实在在的帮助。 百度百科是向用户提供全面、准确、客观的定义性信息，相对来说，百度经验提供的是完成某个目标的过程指导，而且允许一定的主观性，只要能帮助用户达到目标就能称为一篇合格的经验。 百度百科的载体词条可以由所有人协作编写，而百度经验则鼓励所有人撰写和编辑属于自己的经验，一旦经验产生后内容只能由作者修改，以保证能最大程度的保证方法思路的一致性。百科的词条目录按照词条分类的不同，有极大的不同，而不管何种领域的经验，大多可以由概述、工具/原料、步骤/方法、注意事项等几部分组成，模板相对百科来说更加统一。","tags":[]},{"title":"Axure----猫眼电影原型设计","date":"2017-03-09T09:48:51.000Z","path":"2017/03/09/猫眼电影-来个原型看看/","text":"Axure 画的猫眼电影app原型涉及到的组件： 热区 动态面板 一级菜单 二级菜单 动态轮播图 鼠标悬停交互","tags":[]},{"title":"听说要写MRD？","date":"2017-03-09T07:24:31.000Z","path":"2017/03/09/听说要写MRD？＂/","text":"MRD全称Market requirements Documents 市场需求文档。 MRD的定义： 描述什么样的功能和特点的产品，可以在市场上取得成功 MRD的作用： 产品项目由“准备”阶段进入到“实施”阶段的第一文档 MRD在产品中是承上启下的作用 向上是不断对市场不断积累的数据和用户资料的整合和记录向下是对日后的工作的说明和指导。 MRD的基本格式内容： 项目背景 名词解释 可行性分析 重点是 竞品分析报告 综合描述 功能详述 其他问题描述 MRD文档写作4技巧： 充分调研 提高文档可读性 突出重点，关注细节 做好文档版本的管理和培训","tags":[]},{"title":"听说要写PMD?","date":"2017-03-09T06:35:31.000Z","path":"2017/03/09/听说要写PMD/","text":"PMD全称Program Managment Document 项目管理文档。 项目管理文档是项目输出物的重要部分，具有非常重要的6个方面的作用： 管理依据 分工凭证 保证质量 培训资料 维护支持 开发依据 在软件项目管理中，没有统一的格式规定。 和其他项目管理的方式类似，管理的内容无外乎三部分： 项目进度： 时间表，日程表，时间跟踪。 项目资源和成员： 任务，问题追踪，讨论区。 项目输出物： 定制报告，邮件整合。 以上都是所能查找到的PMD写法的方法论。 那么我们是不是应该想一想：产品经理为什么要做项目管理呢？或者说做PMD有什么好处呢 简单的说 有了PMD就可以让项目中的每个子任务都可以找到相应的解决方法，责任人，完成时间。 在整个项目的开始阶段，需要为整个项目准备资源，制定计划。在执行阶段，需要通过各种方法监督项目实施，按时完成项目计划，并最终完成任务。在结束阶段，对项目进行完善和总结做好善后工作和交付工作。 整个PMD都是为了确保项目按计划进行，也就是说遇到问题，解决问题!","tags":[]},{"title":"一生二 二生三  三生万物","date":"2017-03-04T21:09:31.000Z","path":"2017/03/05/一生二，二生三/","text":"&emsp; &emsp;前几天在知乎上面看到一篇 通过HEXO&amp;GITHUB搭建自己博客的教程，磕磕碰碰搞了好长时间才弄好，今天终于有时间，精力坐下来认真写一篇自己的第一篇博文。 &emsp; &emsp;最近一直在跑校招，很尴尬的是 一直没有互相嵌合的工作。虽说自己是计算机专业毕业，可是对于重复的写代码对自己来说并不是很钟情，而是对策划产品，战略分析这方面很有热情和兴趣，感觉听起来这像是数据型产品经理的标签。。。。不知道为什么 好像在知乎上隐约有种对产品经理的鄙视感，哈哈哈可能是程序员比较多吧，尴尬了 &emsp; &emsp;咳咳，自己一直也希望谋得一份产品方向的职位。当然知道自己目前的水平还是差了不少，所以一直在努力提高，学习，记得2017年1月1日0点几分的时候为今年立了一个新年书单的flag.这个flag已经完成1/8，期待完成，加油！！！ 期间也补习了很多关于产品，回顾一下小半年以来自己的成长 python 爬虫 Axure Xmind git SQL excel Visio 自己学的确实听杂乱的，不够系统不过确实了解了很多知识，产品最强调的 人性，需求，，在书本中，接受了凯文.凯利，大前研一，周宏伟，这些巨人的思维，谋略，着手令人钦佩，得安心下来好好学习，思考。 未来还有很长的路要走，我知道自己目前还算入门，今天在此再立个flag期望自己能够再接再厉，每天充满热情与激情。就这样吧，感觉自己初次写文笔还是太差了，期望在这个地方，能够迅速成长起来。 加油，有梦想的人","tags":[]}]